import type { AcceptanceInterface, QuestionInterface } from '@/interface/question'
import type { CoinHistory, GiftHistory } from '@/interface/transaction'

export type UserRoleType = 'PARTICIPANT' | 'STAFF' | 'MODERATOR' | 'ADMIN'
export type EducationLevelType = 'M4' | 'M5' | 'M6' | 'Y1' | 'Y2' | 'Y3' | 'Y4' | 'GRADUATED'

export const cucmAcceptances: AcceptanceInterface[] = [
  {
    text: 'Be Nice & Respectful: พูดคุย ทักทาย และให้เหรียญกันด้วยความสุภาพ',
    checked: false,
  },
  {
    text: 'No Cheating: ห้ามปั๊มเหรียญ ใช้ช่องโหว่ หรือทุจริต',
    checked: false,
  },
  {
    text: 'Fair Play: ห้ามข่มขู่ แย่งชิง หรือสร้างความเดือดร้อนเพื่อให้ได้มาซึ่งของรางวัล',
    checked: false,
  },
  {
    text: 'System Safety: ห้ามพยายามเจาะระบบ หรือทำให้ระบบเสียหาย',
    checked: false,
  },
  {
    text: 'Positive Vibes: ห้ามอิจฉากัน และควรยินดีเมื่อผู้อื่นได้รับของรางวัล',
    checked: false,
  },
  {
    text: 'Ban: ทุกการกระทำทุจริตใด ๆ มีโทษแบน',
    checked: false,
  },
  {
    text: 'Final Decision: กติกาปรับเปลี่ยนได้ และคำตัดสินของทีมงานถือเป็นที่สิ้นสุด',
    checked: false,
  },
  {
    text: 'ข้าพเจ้ายอมรับกฏทุกข้อ และไม่ได้ถูกบังคับให้เล่น CUCM Reward',
    checked: false,
  },
]

export const SECONDARY_YEARS = ['4', '5', '6']
export const ACADEMIC_YEARS = ['1', '2', '3', '4', 'บัณฑิต']

export const participantQuestions: QuestionInterface[] = [
  {
    id: 'QN1',
    title: 'สนใจสายการเรียนไหนอยู่รึเปล่า?',
    answers: ['คณะสายวิทย์สุขภาพ', 'คณะสายวิทย์กายภาพ', 'คณะสายมนุษย์-สังคม'],
  },
  {
    id: 'QN2',
    title: 'ทำไมถึงสนใจเรียนต่อจุฬาฯ?',
    answers: [
      'เกย์จุฬา',
      'มอท็อปประเทศมันเฟี้ยว',
      'เพราะน้ำใจน้องพี่สีชมพู',
      'อยากยิ่งใหญ่ อยากเป็นเศรษฐี',
      'ดูคอนเนคชั่นดี ดูมีโอกาสมากกว่า',
      'อยากไปเรียนไกลบ้านบ้าง เบื่อเชียงใหม่',
      'พ่อแม่อยากให้เรียน',
      'ยังไม่ตัดสินใจ แวะมาหาความรู้เฉย ๆ',
      'ไม่รู้ แค่ชอบสีชมพูเฉย ๆ',
      'ไม่รู้ ตามเพื่อน',
    ],
  },
  {
    id: 'QN3',
    title: 'เป็นคนประเภทไหนในห้อง?',
    answers: [
      'ตั้งใจเรียนสุด ๆ',
      'ต้นฉบับการบ้าน',
      'เข้าทุกคาบแต่ไม่ทราบอะไรเลย',
      'สายหลับ หลับตลอดเวลา',
      'แก๊งเกมเมอร์ ว่างแล้วต้องตี้',
      'อยู่เงียบ ๆ แบบประหยัดพลังงาน',
      'สายฮา ตบมุกโบ๊ะบ๊ะ',
      'บ้าพลัง ชอบเล่นกีฬา',
      'Extrovert รู้จักคนทั้งโรงเรียน',
      'สายกิจกรรม งานอะไรพี่ไปหมด',
      'รักสวยรักงามแบบ Slay Energy',
      'พกความฝันไว้ในสมุดวาดเขียน',
      'มาโรงเรียนเพื่อเจอเพื่อน เข้าสังคม',
      '(มา)สายเสมอต้นเสมอปลาย',
      'ดาว TikTok',
    ],
  },
  {
    id: 'QN4',
    title: 'ชอบอะไรโรงเรียนตัวเองที่สุด?',
    answers: [
      'เข้มแข็งด้านวิชาการ',
      'หลักสูตรหลายอย่างน่าสนใจ',
      'เพื่อน ๆ น่ารัก',
      'นักเรียนมีแต่คนหน้าตาดี',
      'คุณครูใจดี สอนสนุก',
      'โรงอาหารข้าวอร่อย',
      'กิจกรรมในโรงเรียนแบบปึ้ง',
      'เครื่องแบบนักเรียนเกร๋มาก',
      'บรรยากาศดี',
      'ห้องสมุดคือ Safe zone',
      'เดินทางง่าย',
      'เพื่อน/รุ่นพี่/รุ่นน้อง คนนั้น ><',
      'ไม่รู้เหมือนกัน คิดไม่ออก',
    ],
  },
  {
    id: 'QN5',
    title: 'งานอดิเรกที่ชอบทำในช่วงนี้?',
    answers: [
      'นอน',
      'อ่านหนังสือ/นิยาย/การ์ตูน',
      'ดูหนัง/ซีรีส์/อนิเมะ',
      'เล่นเกม',
      'เล่นกีฬา',
      'ดู Youtube',
      'ออกไปเที่ยว',
      'เป็นวัยรุ่น TikTok',
      'ฟังเพลง',
      'ทำงานศิลปะ',
      'ร้องเพลง',
      'คราฟต์งานเขียน',
      'ถ่ายภาพ',
      'เล่นดนตรี',
      'ทำอะไรพีค ๆ ที่นอกจากในนี้',
    ],
  },
  {
    id: 'QN6',
    title: 'ถ้าพรุ่งนี้โลกแตกจะทำอะไร?',
    answers: [
      'นอน',
      'ร้องไห้ก่อน',
      'ทำงานอดิเรกที่ชอบ',
      'ออกไปกินของอร่อย',
      'ซื้อทุกอย่างที่อยากซื้อ',
      'สารภาพรักกับคนที่ชอบ',
      'ใช้เวลาอยู่กับแฟน',
      'ใช้เวลาอยู่กับเพื่อน',
      'ใช้เวลาอยู่กับครอบครัว',
      'ชิว แล้วผมจะไปแคร์(เห้)ไร',
      'ไปที่ ๆ อยากไป',
      'เคลียร์ทุกอย่างที่อยากทำแต่ไม่กล้า',
      'แกล้งบ้าดีกว่าพรี่',
    ],
  },
]

export const seniorQuestions: QuestionInterface[] = [
  {
    id: 'QS1',
    title: 'คิดยังไงกับคณะที่เรียนอยู่?',
    answers: [
      'สนุกมากกกกก',
      'เฉย ๆ อยู่ได้ ได้อยู่',
      'เรียนหนักแต่ไหว',
      'หนี F',
      'อยากลาออกทุกวัน',
    ],
  },
  {
    id: 'QS2',
    title: 'ทำไมถึงเลือกเรียนจุฬาฯ?',
    answers: [
      'เกย์จุฬา',
      'มอท็อปประเทศมันเฟี้ยว',
      'เพราะน้ำใจน้องพี่สีชมพู',
      'อยากยิ่งใหญ่ อยากเป็นเศรษฐี',
      'ดูคอนเนคชั่นดี ดูมีโอกาสมากกว่า',
      'อยากไปเรียนไกลบ้านบ้าง เบื่อจังหวัดตัวเอง',
      'พ่อแม่อยากให้เรียน',
      'ไม่รู้ แค่ชอบสีชมพูเฉย ๆ',
      'ไม่รู้ ตามเพื่อน',
    ],
  },
  {
    id: 'QS3',
    title: 'ทำไมถึงมาค่ายจุฬา-เชียงใหม่?',
    answers: [
      'อยากลองทำอะไรใหม่ ๆ',
      'เพื่อนชวน',
      'อยากมาเที่ยวเชียงใหม่',
      'อยากทำค่ายอยู่แล้ว',
      'เคยมาค่ายนี้ พอขึ้นมหาลัยเลยมาช่วย',
    ],
  },
  {
    id: 'QS4',
    title: 'อยากมีพลังวิเศษอะไรมากที่สุด?',
    answers: [
      'เป็นอมตะ',
      'รู้อดีต รู้อนาคต',
      'ลอยได้',
      'อ่านใจคน',
      'ฟังพูดอ่านเขียนได้ทุกภาษาบนโลก',
      'วาร์ปได้แบบไม่จำกัดระยะทาง',
      'ย้อนเวลา/หยุดเวลา',
      'มีพลังรักษาคนแบบ Healer',
      'ใช้เวทย์มนตร์',
      'คุยกับสัตว์',
    ],
  },
  {
    id: 'QS5',
    title: 'สถานะในตอนนึ้?',
    answers: [
      'ยังโสด โสด อยู่ทางนี้ยังโสด โสด',
      'มีแฟนแล้ว รักแฟนมาก',
      'กำลังพบเจอมรสุมชีวิต แต่พรี่ไหวอยู่(ไม่)',
      'ถึงตัวจะเป็นผู้ใหญ่ แต่สมองยังเป็นเด็ก',
      'กำลังเดินทางอยู่',
      'รู้สึกไม่อยากโตเป็นผู้ใหญ่',
      'สบายดี ชีวิตแฮปปี้ มีความสุข',
      'เฉย ๆ ไม่แย่ อยู่ได้',
      'อธิษฐานให้โลกแตกทุกวัน',
    ],
  },
  {
    id: 'QS6',
    title: 'ถ้าวันนั้นไม่ติดจุฬาจะทำยังไง?',
    answers: [
      'ร้องไห้ก่อน อย่างอื่นค่อยว่ากัน',
      'ยังไงก็ติดอยู่แล้ว เก่ง มั่นใจ ไม่กลัว',
      'ไปเรียนมหาลัยอื่นก็ได้ งอน',
      'ซิ่ว ฉันจะเป็นเด็กจุฬาฯให้ได้เลย!',
    ],
  },
  {
    id: 'QS7',
    title: 'ในค่ายนี้อยู่ฝ่ายอะไร?',
    answers: [
      'กิจกรรม',
      'ทะเบียน',
      'พี่กลุ่ม',
      'พยาบาล',
      'พิธีการ',
      'วิชาการ',
      'สถานที่',
      'สวัสดิการ-พัสดุ',
      'สันทนาการ',
      'แสงเสียง',
      'หาทุน',
      'PR',
      'Production',
      'Creative',
      'เหรัญญิก',
      'เลขา',
      'ประธาน',
    ],
  },
]

// export const mockCoinHistory: CoinHistory[] = [];
export const mockCoinHistory: CoinHistory[] = [
  {
    id: '1',
    name: 'บัญชีกลางค่ายจุฬา-เชียงใหม่',
    type: 'account',
    coins: 200,
    timestamp: new Date(),
  },
  {
    id: '2',
    name: 'กิจกรรมเปิดค่าย',
    type: 'event',
    coins: 50,
    timestamp: new Date(Date.now() - 1000 * 60 * 60 * 1),
  },
  {
    id: '3',
    name: 'กิจกรรม Ice Breaking',
    type: 'event',
    coins: 40,
    timestamp: new Date(Date.now() - 1000 * 60 * 60 * 2),
  },
  {
    id: '4',
    name: 'กิจกรรมสันทนาการกลางคืน',
    type: 'event',
    coins: 60,
    timestamp: new Date(Date.now() - 1000 * 60 * 60 * 4),
  },
  {
    id: '5',
    name: 'ณัฐชนน สงวนศรี',
    type: 'person',
    coins: 100,
    timestamp: new Date(Date.now() - 1000 * 60 * 60 * 5),
  },
  {
    id: '6',
    name: 'ปพิชญา พรหมทา',
    type: 'person',
    coins: 80,
    timestamp: new Date(Date.now() - 1000 * 60 * 60 * 6),
  },
  {
    id: '7',
    name: 'ศุภกร จิตตรง',
    type: 'person',
    coins: 120,
    timestamp: new Date(Date.now() - 1000 * 60 * 60 * 7),
  },
  {
    id: '8',
    name: 'บัญชีกลางค่ายจุฬา-เชียงใหม่',
    type: 'account',
    coins: 200,
    timestamp: new Date(Date.now() - 1000 * 60 * 60 * 5),
  },
  {
    id: '9',
    name: 'ธิดารัตน์ หอมจันทร์',
    type: 'person',
    coins: 90,
    timestamp: new Date(Date.now() - 1000 * 60 * 60 * 8),
  },
  {
    id: '10',
    name: 'กิตติพงศ์ รัตนวดี',
    type: 'person',
    coins: 110,
    timestamp: new Date(Date.now() - 1000 * 60 * 60 * 2),
  },
  {
    id: '11',
    name: 'ชนิกานต์ โชติวงศ์',
    type: 'person',
    coins: 95,
    timestamp: new Date(Date.now() - 1000 * 60 * 60 * 12),
  },
  {
    id: '12',
    name: 'สุรชัย แสงทอง',
    type: 'person',
    coins: 85,
    timestamp: new Date(Date.now() - 1000 * 60 * 60 * 1),
  },
]

// export const mockGiftHistory: GiftHistory[] = [];
export const mockGiftHistory: GiftHistory[] = [
  {
    id: '1',
    name: 'ณัฐชนน สงวนศรี',
    timestamp: new Date(Date.now() - 1000 * 60 * 30),
  },
  {
    id: '2',
    name: 'ปพิชญา พรหมทา',
    timestamp: new Date(Date.now() - 1000 * 60 * 60 * 6),
  },
  {
    id: '3',
    name: 'ศุภกร จิตตรง',
    timestamp: new Date(Date.now() - 1000 * 60 * 60 * 3),
  },
  {
    id: '4',
    name: 'ธิดารัตน์ หอมจันทร์',
    timestamp: new Date(Date.now() - 1000 * 60 * 60 * 5),
  },
  {
    id: '5',
    name: 'กิตติพงศ์ รัตนวดี',
    timestamp: new Date(Date.now() - 1000 * 60 * 60 * 6),
  },
  {
    id: '6',
    name: 'ชนิกานต์ โชติวงศ์',
    timestamp: new Date(Date.now() - 1000 * 60 * 60 * 8),
  },
  {
    id: '7',
    name: 'สุรชัย แสงทอง',
    timestamp: new Date(Date.now() - 1000 * 60 * 60 * 10),
  },
  {
    id: '8',
    name: 'วริศรา ใจดี',
    timestamp: new Date(Date.now() - 1000 * 60 * 60 * 15),
  },
  {
    id: '9',
    name: 'จิรายุส คำดี',
    timestamp: new Date(Date.now() - 1000 * 60 * 60 * 20),
  },
  {
    id: '10',
    name: 'พรนภา สมใจ',
    timestamp: new Date(Date.now() - 1000 * 60 * 60 * 24),
  },
]
